# Creating Permanent Tables
Explanation:
This code snippet demonstrates the process of creating a permanent table in SQL. Here are the steps performed:

1. Create a new database using the `CREATE DATABASE` statement.
2. Switch to the newly created database using the `USE` statement.
3. Create a new table named "employees" with columns "id", "name", "age", and "salary" using the `CREATE TABLE` statement.
4. Insert data into the table using the `INSERT INTO` statement.
5. Retrieve all data from the table using the `SELECT * FROM` statement.
6. Update the salary of an employee using the `UPDATE` statement.
7. Delete a row from the table using the `DELETE FROM` statement.
8. Retrieve specific data from the table using the `SELECT` statement with a `WHERE` clause.
9. Drop the table using the `DROP TABLE` statement.
10. Drop the database using the `DROP DATABASE` statement.

The code is well-commented to explain each step and the expected output is mentioned after each print statement.

In [ ]:
-- Creating a permanent table in SQL

-- Create a new database
CREATE DATABASE mydatabase;
USE mydatabase;

-- Create a new table with columns and data types
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    salary DECIMAL(10,2)
);

-- Insert data into the table
INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000.00),
       (2, 'Jane Smith', 35, 60000.00),
       (3, 'Mike Johnson', 25, 45000.00);

-- Retrieve all data from the table
SELECT * FROM employees;

-- Update data in the table
UPDATE employees
SET salary = 55000.00
WHERE id = 1;

-- Delete data from the table
DELETE FROM employees
WHERE id = 3;

-- Retrieve specific data from the table
SELECT name, age
FROM employees
WHERE salary > 55000.00;

-- Drop the table
DROP TABLE employees;

-- Drop the database
DROP DATABASE mydatabase;

# Creating Temporary Tables
Summary:
In SQL, temporary tables are used to store data temporarily within a session. They are useful for storing intermediate results or performing complex calculations. Temporary tables are only accessible within the session that created them and are automatically dropped when the session ends or when explicitly dropped using the `DROP TEMPORARY TABLE` statement. Temporary tables can be created with specific columns and data types or can be created based on the structure of an existing table. Data can be inserted into temporary tables using the `INSERT INTO` statement, and the data can be queried using the `SELECT` statement.

In [ ]:
-- Creating a temporary table in SQL

-- Create a temporary table with a single column
CREATE TEMPORARY TABLE temp_table (
    id INT
);

-- Insert data into the temporary table
INSERT INTO temp_table (id) VALUES (1), (2), (3);

-- Select all rows from the temporary table
SELECT * FROM temp_table;
-- Expected output: 
-- id
-- 1
-- 2
-- 3

-- Create a temporary table with multiple columns
CREATE TEMPORARY TABLE temp_table2 (
    id INT,
    name VARCHAR(50)
);

-- Insert data into the temporary table
INSERT INTO temp_table2 (id, name) VALUES (1, 'John'), (2, 'Jane'), (3, 'Alice');

-- Select all rows from the temporary table
SELECT * FROM temp_table2;
-- Expected output: 
-- id | name
-- 1  | John
-- 2  | Jane
-- 3  | Alice

-- Create a temporary table with the structure of an existing table
CREATE TEMPORARY TABLE temp_table3 AS
SELECT * FROM existing_table WHERE condition;

-- Select all rows from the temporary table
SELECT * FROM temp_table3;
-- Expected output: 
-- Same as the result of the SELECT statement used to create temp_table3

-- Drop the temporary tables when they are no longer needed
DROP TEMPORARY TABLE temp_table;
DROP TEMPORARY TABLE temp_table2;
DROP TEMPORARY TABLE temp_table3;

# Cloning Tables
Explanation:
In SQL, you can clone a table by using the `SELECT INTO` statement. This statement allows you to create a new table with the same structure and data as an existing table.

In the code snippet above, we first create a table called `employees` with columns `id`, `name`, `age`, and `salary`. Then, we insert some sample data into the `employees` table.

To clone the `employees` table, we use the `SELECT INTO` statement. This statement selects all the data from the `employees` table and creates a new table called `employees_clone` with the same structure and data.

Finally, we display the cloned table by selecting all the rows from the `employees_clone` table.

Expected output:
```
id |     name     | age | salary
---+--------------+-----+--------
1  | John Doe     | 30  | 50000.00
2  | Jane Smith   | 35  | 60000.00
3  | Mike Johnson | 40  | 70000.00
```

The `employees_clone` table will have the same structure and data as the `employees` table. Cloning tables can be useful when you want to create a backup or make a copy of an existing table for further analysis or modifications without affecting the original table.

In [ ]:
-- Create a table
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    salary DECIMAL(10, 2)
);

-- Insert data into the table
INSERT INTO employees (id, name, age, salary)
VALUES (1, 'John Doe', 30, 50000),
       (2, 'Jane Smith', 35, 60000),
       (3, 'Mike Johnson', 40, 70000);

-- Clone a table using SELECT INTO statement
SELECT *
INTO employees_clone
FROM employees;

-- Display the cloned table
SELECT * FROM employees_clone;